import 'package:flutter/material.dart';
import 'package:url_launcher/url_launcher.dart';

// Colors
const Color kPrimaryColor = Color(0xffC0392B);

// Social Media
const kSocialIcons = [
  "https://img.icons8.com/metro/208/ffffff/facebook-new--v2.png",
  "https://img.icons8.com/ios-glyphs/480/ffffff/instagram-new.png",
  "https://img.icons8.com/android/480/ffffff/twitter.png",
  "https://img.icons8.com/metro/308/ffffff/linkedin.png",
  "https://img.icons8.com/material-rounded/384/ffffff/github.png",
  "https://img.icons8.com/ios-filled/500/ffffff/medium-monogram--v1.png"
];

const kSocialLinks = [];

// URL Launcher
void launchURL(String _url) async =>
    await canLaunch(_url) ? await launch(_url) : throw 'Could not launch $_url';

// Contact
final kContactIcons = [
  Icons.home,
  Icons.phone,
  Icons.mail,
];

final kContactTileColor = [
  Colors.blue[50],
  Colors.teal[50],
  Colors.blueGrey[50],
];

final kContactTitles = [
  "Location",
  "Phone",
  "Email",
];

final kContactDetails = [
  "24, MG Road, Halwasiya Court, Lucknow",
  "+91 726-303-9909, +91 885-892-0668",
  "vaishfederationup@gmail.com"
];

class AppConstants {
  static List memb = [
    ['श्री राकेश गुप्ता साई ', 'अलीगढ ', 'प्रदेश उपाध्यक्ष ', '9412273638'],
    ['श्री सुनील रामा ', 'बुलंदशहर ', 'प्रदेश उपाध्यक्ष', '9358022508'],
    ['श्री हेमंत सिंघल ', 'ग़ाज़ियाबाद ', 'प्रदेश उपाध्यक्ष', '9312119633'],
    ['श्री रजनीश गुप्ता ', 'लखनऊ ', 'प्रदेश उपाध्यक्ष', '9335912462'],
    [
      'श्री संजय साहू',
      'महोबा',
      'प्रदेश उपाध्यक्ष',
      '9415145030',
    ],
    [
      'श्री अरविन्द विक्रम चौधरी ',
      'गोरखपुर ',
      'प्रदेश उपाध्यक्ष',
      '9415282687'
    ],
    ['श्री मनोज जायसवाल ', 'अयोध्या ', 'प्रदेश उपाध्यक्ष', '9450231420'],
    ['श्री  अरुण जायसवाल ', 'वाराणसी ', 'प्रदेश उपाध्यक्ष', '9161501247'],
    ['श्री रत्नेश दाऊजी गुप्ता', 'लखनऊ', 'प्रदेश उपाध्यक्ष', '9839013567'],
    ['श्री प्रदीप सरावगी', 'झाँसी', 'प्रदेश उपाध्यक्ष', '9415073498'],
    [
      'श्री विनय वर्मा (विधायक)',
      'सिद्धार्थनगर ',
      'प्रदेश उपाध्यक्ष',
      '9818444806'
    ],
    ['श्री विकास गुप्ता (विधायक)', 'फतेहपुर', 'प्रदेश उपाध्यक्ष', '9918046999'],
    [
      'श्री संजय गुप्ता (पूर्व विधायक)',
      'कौशाम्बी',
      'प्रदेश उपाध्यक्ष',
      '9076775556'
    ],
    ['श्री शिव कुमार गुप्ता', 'गाजियाबाद', 'प्रदेश उपाध्यक्ष', '9310860065'],
    ['श्रीमती शिप्रा रस्तोगी', 'मेरठ', 'प्रदेश उपाध्यक्ष', '8171263444'],
    ['', '', '', ''],
    ['श्री शैलेन्द्र अग्रहरि', 'मिर्जापुर ', 'प्रदेश महामंत्री', '8858920668'],
    ['डा0 सुधीर गुप्ता', 'शाहजहांपुर ', 'प्रदेश महामंत्री', '9919811111'],
    ['श्री भारत भूषण गुप्ता', 'रामपुर ', 'प्रदेश महामंत्री', '9412364249'],
    ['', '', '', ''],
    ['श्री प्रदीप अग्रवाल', 'मुरादाबाद ', 'प्रदेश मंत्री', '9997913703'],
    ['श्री संजय अग्रवाल', 'हापुड़ ', 'प्रदेश मंत्री', '9897451600'],
    ['श्री कुलदीप गुप्ता ', 'इटावा', 'प्रदेश मंत्री', '९४११९९३०३०'],
    ['श्री अमित गुप्ता ', 'मऊ ', 'प्रदेश मंत्री', '9839486392'],
    ['श्री अमित वाष्र्णेय', 'सम्भल ', 'प्रदेश मंत्री', '9219600940'],
    ['श्री सम्पूर्णानन्द गुप्ता', 'देवरिया', 'प्रदेश मंत्री', '9415973331'],
    ['श्री नरेन्द्र दमेले', 'झांसी ', 'प्रदेश मंत्री', '9415949313'],
    ['श्री सुशान्त केसरवानी', 'प्रयागराज ', 'प्रदेश मंत्री', '9335976529'],
    ['श्री संजय गोविल', 'मथुरा ', 'प्रदेश मंत्री', '9412828813'],
    ['श्री लल्लन प्रसाद गुप्ता', 'गाजीपुर ', 'प्रदेश मंत्री', '9919012676'],
    ['श्री संजय गुप्ता', 'सहारनपुर ', 'प्रदेश मंत्री', '7830065533'],
    ['डा0 शशि जायसवाल ', 'बाराबंकी ', 'प्रदेश मंत्री', '9415048627'],
    ['श्री रमेश कसौधन', 'बलरामपुर ', 'प्रदेश मंत्री', '8604414000'],
    ['डा0 आदित्य अग्रवाल', 'बिजनौर ', 'प्रदेश मंत्री', '8899115253'],
    ['श्री विनय खण्डेलवाल', 'बरेली ', 'प्रदेश मंत्री', '9837094886'],
    ['', '', '', ''],
    ['श्री सौरभ गुप्ता', 'मुरादाबाद ', 'कोषाध्यक्ष', '9412244588'],
    ['श्री शिवम बरनवाल', 'भदोही ', 'प्रदेश सह-कोषाध्यक्ष', '8601870151'],
    ['श्री राजेश शंकर राजू', 'सम्भल ', 'प्रदेश सह-कोषाध्यक्ष', '9319939188'],
  ];

  static List vishesh = [
    ['श्री राजेन्द्र अग्रवाल', 'मेरठ ', 'सांसद', '9412202623'],
    ['श्री संगमलाल गुप्ता', 'प्रतापगढ़ ', 'सांसद', '9821876739'],
    ['श्री अनिल अग्रवाल', 'गाजियाबाद ', 'सांसद', '9910483700'],
    [
      'श्री उमेश कुमार मित्तल (आई.ए.एस.)',
      'लखनऊ',
      'प्र०का०सदस्य ',
      '9415202222'
    ],
    ['श्री योगेश अग्रवाल', 'कानपुर', 'प्र०का० सदस्य', '9936303500'],
    ['श्री विनय लोहिया', 'मुरादाबाद', 'प्र०का० सदस्य', '9837092001'],
    [
      'श्री प्रदीप जैन आदित्य (पूर्व केन्द्रीय मंत्री)',
      'झांसी ',
      'वरि. राष्ट्रीय उपाध्यक्ष',
      '8376082666'
    ],
    [
      'श्री राजेश अग्रवाल (पूर्व मंत्री उ.प्र. सरकार)',
      'बरेली ',
      'पूर्व प्रदेश अध्यक्ष',
      '9412287576'
    ],
    [
      'श्री नन्द गोपाल गुप्ता नन्दी',
      'प्रयागराज',
      'कैबिनेट मंत्री, उत्तर प्रदेश सरकार ',
      '9839609501'
    ],
    [
      'श्री कपिल देव अग्रवाल ',
      'मुजफ्फरनगर',
      'राज्यमंत्री स्वतंत्र प्रभार, उ.प्र. सरकार',
      '9837067089'
    ],
    [
      'श्री रविन्द्र जायसवाल',
      'वाराणसी',
      'राज्यमंत्री स्वतंत्र प्रभार, उ.प्र. सरकार',
      '9415202394'
    ],
    [
      'श्री नितिन अग्रवाल',
      'हरदोई',
      'राज्यमंत्री स्वतंत्र प्रभार, उ.प्र. सरकार',
      '9839721000'
    ],
    [
      'श्री राकेश राठौर ’गुरू’',
      'सीतापुर ',
      'राज्यमंत्री उ.प्र. सरकार',
      '8081033527'
    ],
    [
      'श्री के.एल. गुप्ता (आई.पी.एस.)',
      'चित्रकूट',
      'पूर्व डी.जी.पी.',
      '9415013433'
    ],
    [
      'श्री रविकान्त गर्ग',
      'मथुरा',
      'व्यापारी कल्याण बोर्ड,उ.प्र.',
      '9412278777'
    ],
    [
      'कैप्टन विकास गुप्ता',
      'नोयडा',
      'अध्यक्ष, कृषि अनुसंधान परिषद उ.प्र. सरकार',
      '9350645224'
    ],
    ['श्रीमती विमला बाथम', 'नोयडा', 'अध्यक्ष, राज्य महिला आयोग', '9810492224'],
    [
      'श्री अशोक गोयल',
      'गाजियाबाद',
      'उपाध्यक्ष, व्यापारी कल्याण बोर्ड, उ.प्र.',
      '9810229421'
    ],
    [
      'श्री पुष्पदन्त जैन',
      'गोरखपुर',
      'उपाध्यक्ष, व्यापारी कल्याण बोर्ड, उ.प्र.',
      '9793804000'
    ],
    [
      'श्री मनीष गुप्ता',
      'लखनऊ',
      'उपाध्यक्ष, व्यापारी कल्याण बोर्ड, उ.प्र.',
      '9415016353'
    ],
    [
      'श्रीमती अंजू चैधरी (पूर्व महापौर)',
      'गोरखपुर',
      'उपाध्यक्ष, राज्य महिला आयोग, उ.प्र. सरकार',
      '9935311226'
    ],
    ['श्री अनिल के. जाजोडिया', 'वाराणसी', 'राष्ट्रीय उपाध्यक्ष', '9415201641'],
    ['श्री नटवर गोयल', 'लखनऊ', 'राष्ट्रीय उपाध्यक्ष', '9453015635'],
    ['श्री एन.के. गुप्ता', 'नोयडा', 'राष्ट्रीय सह-कोषाध्यक्ष', '9810031691'],
    ['श्री प्रमोद कुमार गुप्ता', 'नोयडा', 'राष्ट्रीय उपाध्यक्ष', '9899971060'],
    ['श्री अनुज गोयल', 'गाजियाबाद', 'राष्ट्रीय मंत्री', '9810425395'],
    ['श्रीमती रीता मित्तल', 'लखनऊ', 'राष्ट्रीय संगठन मंत्री', '9415032222'],
    ['श्री गिरीश बंसल', 'मेरठ', 'पूर्व प्रदेश कार्यकारी अध्यक्ष', '9837020390'],
    [
      'श्री भगीरथमल पचेरीवाल',
      'अयोध्या',
      'पूर्व प्रदेश कार्यकारी अध्यक्ष',
      '9336626000'
    ],
    ['श्री सचिन अग्रवाल', 'मुजफफरनगर', 'पूर्व प्रदेश महामंत्री', '7017110181'],
    [
      'श्री किशोर कुमार गुप्ता',
      'शाहजहांपुर',
      'पूर्व प्रदेश महामंत्री',
      '9415035667'
    ],
    ['श्री सुनील गुप्ता', 'लखनऊ', 'पूर्व प्रदेश महामंत्री', '9305351871'],
  ];

  static List<String> headingsMandal = ['कार्यक्षेत्र ', 'प्रभारी का नाम'];

  static List karyasamiti = [
    ['श्री अमल जायसवाल', 'सोनभद्र ', 'कार्यसमिति सदस्य', '9026689770'],
    ['श्री संजय गुप्ता', 'कुशीनगर ', 'कार्यसमिति सदस्य', '9839185922'],
    ['श्री शिवस्वरूप गुप्ता', 'बदायूं ', 'कार्यसमिति सदस्य', '9027385599'],
    ['श्री श्याम मुरारी गुप्ता', 'इटावा ', 'कार्यसमिति सदस्य', '9411870426'],
    ['श्री कन्हैया लाल गुप्ता', 'औरैया ', 'कार्यसमिति सदस्य', '9997565095'],
    [
      'श्री श्याम किशोर (लालू मित्तल)',
      'प्रयागराज ',
      'कार्यसमिति सदस्य',
      '9415217194'
    ],
    ['श्री राजकुमार केसरवानी', 'प्रयागराज ', 'कार्यसमिति सदस्य', '8318175929'],
    ['डा0 रीता जायसवाल', 'वाराणसी ', 'कार्यसमिति सदस्य', '7897992917'],
    ['श्री राहुल बरनवाल', 'मिर्जापुर ', 'कार्यसमिति सदस्य', '9415362112'],
    ['श्री शत्रुहन केसरी', 'मिर्जापुर ', 'कार्यसमिति सदस्य', '9653032517'],
    ['श्री धर्मेन्द्र जायसवाल', 'बस्ती ', 'कार्यसमिति सदस्य', '9415069313'],
    ['श्री कुलभूषण वाष्र्णेय', 'नोयडा ', 'कार्यसमिति सदस्य', '9639004454'],
    ['श्री राजेश अग्रवाल', 'कासगंज ', 'कार्यसमिति सदस्य', '9837340849'],
    ['श्री अनिल अग्रवाल', 'बरेली ', 'कार्यसमिति सदस्य', '9528839443'],
    ['श्री जगदीश गुप्ता', 'बरेली ', 'कार्यसमिति सदस्य', '8923148016'],
    ['श्री संजय अग्रवाल', 'बरेली ', 'कार्यसमिति सदस्य', '9412293815'],
    ['श्री राजीव सिंघल', 'रामपुर ', 'कार्यसमिति सदस्य', '9837032465'],
    ['श्री ऋतुराज बास', 'बरेली ', 'कार्यसमिति सदस्य', '9412605731'],
    ['श्री अमित शिवहरे', 'फतेहपुर ', 'कार्यसमिति सदस्य', '9984411110'],
    ['श्री निशिथ ऐरन', 'बिजनौर ', 'कार्यसमिति सदस्य', '9358339900'],
    ['श्री सुमंत गुप्ता', 'सम्भल ', 'कार्यसमिति सदस्य', '7500108888'],
    ['श्री अनिल बहुगुणा', 'उरई-जालौन ', 'कार्यसमिति सदस्य', '9415592903'],
    ['श्री अविरल कुबेले', 'रायबरेली ', 'कार्यसमिति सदस्य', '9415034409'],
    ['श्री नवनीत गुप्ता', 'बदायूं ', 'कार्यसमिति सदस्य', '7071927171'],
    ['श्री संजीव जायसवाल', 'सिद्धार्थनगर ', 'कार्यसमिति सदस्य', '7408426846'],
    ['श्री पंकज गुप्ता', 'सहारनपुर ', 'कार्यसमिति सदस्य', '9528777324'],
    ['श्री अजीत अग्रवाल', 'फिरोजाबाद ', 'कार्यसमिति सदस्य', '9219269699'],
    ['श्रीमती संगीता गुप्ता', 'लखनऊ ', 'कार्यसमिति सदस्य', '9936008889'],
    ['श्री केशव बिगुलर', 'अयोध्या ', 'कार्यसमिति सदस्य', '9453475383'],
    ['श्री अंकुर जैन', 'मेरठ ', 'कार्यसमिति सदस्य', '9639670969'],
    ['श्री विश्वनाथ जायसवाल', 'बस्ती ', 'कार्यसमिति सदस्य', '9415037396'],
    ['श्री सुधाकर गुप्ता', 'बलिया ', 'कार्यसमिति सदस्य', '7068233836'],
    ['श्री सुनील बरनवाल ', 'देवरिया ', 'कार्यसमिति सदस्य', '9628294501'],
    ['श्री आदित्य अग्रवाल', 'लखनऊ ', 'कार्यसमिति सदस्य', '9839015076'],
    ['डा0 राजीव गुप्ता', 'बागपत ', 'कार्यसमिति सदस्य', '9359229993'],
    ['श्री विनोद सेठ', 'वाराणसी ', 'कार्यसमिति सदस्य', '7007146459'],
    ['श्री जगभूषण गर्ग', 'नोयडा ', 'कार्यसमिति सदस्य', '9350251664'],
    ['श्री प्रभात जैन', 'आगरा ', 'कार्यसमिति सदस्य', '9368436660'],
    ['श्री अश्वनी गर्ग ', 'नोयडा ', 'कार्यसमिति सदस्य', '9711196112'],
    ['श्री गिरधारी लाल साहू', 'बस्ती ', 'कार्यसमिति सदस्य', '9415037177'],
    ['श्री आर.के. गुप्ता ', 'लखनऊ', 'कार्यसमिति सदस्य', '6391377777'],
    ['श्री प्रवीण बरनवाल', 'आजमगढ़', 'कार्यसमिति सदस्य', '9415840000'],
    ['श्री रविशंकर गर्ग ', 'लखनऊ ', '', '9415026289'],
    ['श्री योगेश जैन ', 'लखनऊ', 'कार्यसमिति सदस्य', '8874203825'],
    ['श्री ओमजी गुप्ता ', 'बाराबंकी ', 'कार्यसमिति सदस्य', '9450208108'],
    ['श्री सचिन तराना  ', 'उन्नाव  ', 'कार्यसमिति सदस्य', '9454004555'],
    ['श्री शिवजी अग्रवाल', 'सोनभद्र', 'कार्यसमिति सदस्य', '9451635401'],
    ['डा० अनिल जैन', 'अमरोहा ', 'कार्यसमिति सदस्य', '9837457166'],
    [
      'श्री धर्मेंद्र अग्रहरि',
      'सुल्तानपुर  ',
      'कार्यसमिति सदस्य',
      '9839825882'
    ],
    ['श्री विनोद गुप्ता', 'अमरोहा ', 'कार्यसमिति सदस्य', '9837103494'],
    ['श्री मुकेश गुप्ता ', 'अमरोहा', 'कार्यसमिति सदस्य', '9837103494'],
    ['श्री मनोज गुप्ता   ', 'देवरिया  ', 'कार्यसमिति सदस्य', '8874686000'],
    ['श्री राजीव जायसवाल', 'बस्ती  ', 'कार्यसमिति सदस्य', '9839918711'],
    ['श्री राममोहन अग्रवाल', 'लखनऊ  ', 'कार्यसमिति सदस्य', '9415024848'],
    ['श्री स्वतंत्र अग्रवाल', 'कानपुर  ', 'कार्यसमिति सदस्य', '9415041585'],
    ['श्री रविराज शरण ', 'अमरोहा  ', 'कार्यसमिति सदस्य', '9837232446'],
    ['श्री धर्मपाल गोयल  ', 'नोयडा  ', 'कार्यसमिति सदस्य', '9810195100'],
    ['श्री रामशंकर गुप्ता', 'लखनऊ  ', 'कार्यसमिति सदस्य', '9839927311'],
    [
      'श्री ज्ञानचंद्र गुप्ता ',
      'मिर्जापुर  ',
      'कार्यसमिति सदस्य',
      '9451329181'
    ],
  ];

  static List magazineList = [
    [
      'श्री अनूप अग्रवाल',
      'लखनऊ  ',
      'संपादक / विशेष आमंत्रित सदस्य   ',
      '9919919915'
    ],
    [
      'श्री मनीष खेमका  ',
      'लखनऊ  ',
      'कार्यकारी संपादक / विशेष आमंत्रित सदस्य',
      '7607226666'
    ],
  ];

  static List mahilaSamiti = [
    [
      'श्रीमती सुप्रिया ऐरन (पूर्व महापौर)',
      'बरेली ',
      'प्रदेश अध्यक्ष',
      '9897088401'
    ],
    ['डा0 ममता वाष्र्णेंय', 'नोयडा ', 'प्रदेश महामंत्री', '9412751605'],
    ['श्रीमती विजय लक्ष्मी', 'फतेहपुर ', 'प्रदेश महामंत्री', '7007507152'],
  ];

  static List yuvaSamiti = [
    ['श्री श्रीराम अग्रवाल', 'बिजनौर ', 'प्रदेश अध्यक्ष युवा', '9997656825'],
    ['श्री दीपेश गुप्ता', 'लखीमपुर ', 'प्रदेश महामंत्री', '7521011112'],
    ['श्री सुधांशु खण्डेलवाल', 'मथुरा ', 'प्रदेश महामंत्री', '9761442440'],
  ];

  static List mandalPrabhari = [
    ['युवा इकाई', 'श्री विनय वर्मा', 'प्रदेश उपाध्यक्ष', '9818444806'],
    ['महिला इकाई', 'श्रीमती शिप्रा रस्तोगी', 'प्रदेश उपाध्यक्ष', '8171263444'],
    ['गोरखपुर मण्डल', 'श्री विक्रम चैधरी', 'प्रदेश उपाध्यक्ष', '9415282687'],
    ['वाराणसी मण्डल', 'श्री अरूण जायसवाल', 'प्रदेश उपाध्यक्ष', '9161501247'],
    ['झांसी मण्डल', 'श्री प्रदीप सरावगी', 'प्रदेश उपाध्यक्ष', '9415073498'],
    [
      'अलीगढ़ मण्डल',
      'श्री राकेश गुप्ता ’साई’',
      'प्रदेश उपाध्यक्ष',
      '9412273638'
    ],
    [
      'लखनऊ मण्डल',
      'श्री रजनीश गुप्ता ’बाबी’',
      'प्रदेश उपाध्यक्ष',
      '9335912462'
    ],
    ['मेरठ मण्डल', 'श्री हेमन्त सिंघल', 'प्रदेश उपाध्यक्ष', '9312119633'],
    ['अयोध्या मण्डल', 'श्री मनोज जायसवाल', 'प्रदेश उपाध्यक्ष', '9450231420'],
    ['मुरादाबाद मण्डल', 'श्री प्रदीप अग्रवाल', 'प्रदेश मंत्री', '9997913703'],
    ['आजमगढ़ मण्डल', 'श्री अमित गुप्ता ', 'प्रदेश मंत्री', '9839486392'],
    ['आगरा मण्डल', 'श्री संजय गोविल', 'प्रदेश मंत्री ', '9412828813'],
    ['सहारनपुर मण्डल', 'श्री संजय गुप्ता', 'प्रदेश मंत्री ', '7830065533'],
    ['देवीपाटन मण्डल', 'श्री रमेश कसौधन  ', 'प्रदेश मंत्री ', '8604414000'],
    ['विध्यांचल मण्डल', 'श्री शत्रुघ्न केसरी', 'प्र0का0 सदस्य ', '9653032517'],
    [
      'प्रयागराज मण्डल',
      'श्री राजकुमार केसरवानी',
      'प्र0का0 सदस्य ',
      '8318175929'
    ],
    ['बरेली मण्डल', 'श्री अनिल अग्रवाल', 'प्र0का0 सदस्य', '9528839443'],
    ['बस्ती मण्डल', 'श्री संजीव जायसवाल', 'प्र0का0 सदस्य', '7408426846'],
  ];

  static List jillaAdhyaksh = [
    ['श्री प्रभात कृष्णा', 'सम्भल ', 'जिला अध्यक्ष ', '9837120433'],
    ['श्री तारा चन्द्र अग्रहरि', 'मीरजापुर ', 'जिला अध्यक्ष ', '9651885321'],
    ['श्री रोहित गुप्ता', 'मऊ ', 'जिला अध्यक्ष ', '9451369048'],
    ['श्री राजेश अग्रवाल ', 'रायबरेली ', 'जिला अध्यक्ष ', '7310000119'],
    ['श्री हरीश अग्रवाल', 'रामपुर ', 'जिला अध्यक्ष ', '9412478690'],
    ['श्री अतुल जैन', 'झाॅसी ', 'जिला अध्यक्ष ', '9415586530'],
    ['श्री नवीन मित्तल', 'मुजफ्फरनगर ', 'जिला अध्यक्ष ', '7019416151'],
    ['श्री दिनेश गुप्ता', 'सराहनपुर ', 'जिला अध्यक्ष ', '8445851302'],
    ['श्री राजेश रस्तोगी', 'मुरादाबाद ', 'जिला अध्यक्ष ', '9927551300'],
    ['डा0 विपिन गुप्ता', 'हापुड़ ', 'जिला अध्यक्ष ', '9837791131'],
    ['श्री पंकज गुप्ता', 'शामली ', 'जिला अध्यक्ष ', '9412531001'],
    ['श्री अशोक मित्तल', 'बुलन्दशहर ', 'जिला अध्यक्ष ', '9358011605'],
    ['श्री मनोज गोयल', 'नोएडा ', 'जिला अध्यक्ष ', '9311124224'],
    [' श्री दीपक अग्रवाल', 'बिजनौर ', 'जिला अध्यक्ष ', '8533905222'],
    ['श्री देवेन्द्र अग्रहरि ', 'अयोध्या ', 'जिला अध्यक्ष ', '9415918607'],
    ['श्री शिवाजी गुप्ता', 'सन्त कबीर नगर', 'जिला अध्यक्ष ', '8601026391'],
    ['श्री सुनील गुप्ता', 'गाजीपुर ', 'जिला अध्यक्ष ', '9794201282'],
    ['श्री विजय जायसवाल', 'अम्बेडकर नगर ', 'जिला अध्यक्ष ', '9792599599'],
    ['श्री कन्हैया लाल वाष्र्णेय', 'हाथरस ', 'जिला अध्यक्ष ', '9410644013'],
    ['श्री सौरभ कुमार', 'एटा ', 'जिला अध्यक्ष ', '9219507503'],
    ['श्री एम0सी0 गुप्ता', 'अलीगढ़ ', 'जिला अध्यक्ष ', '9410426225'],
    ['श्री प्रदीप जायसवाल', 'जौनपुर ', 'जिला अध्यक्ष ', '8874867151'],
    ['श्री अरविन्द गुप्ता ', 'श्रावस्ती ', 'जिला अध्यक्ष ', '9415121528'],
    ['श्री मनीष गुप्ता ', 'प्रयागराज ', 'जिला अध्यक्ष ', '9919101155'],
    ['श्री संजय बरनवाल ', 'कुशीनगर ', 'जिला अध्यक्ष ', '8115150083'],
    ['श्री हेमेंद्र गर्ग ', 'मथुरा ', 'जिला अध्यक्ष ', '9870919437'],
    ['श्री मनीष अग्रवाल ', 'बरेली ', 'जिला अध्यक्ष ', '9319466666'],
    ['श्री आकाशदीप गुप्ता ', 'लखनऊ ', 'जिला अध्यक्ष ', '9005696911'],
    ['श्री राघव प्रसाद गर्ग ', 'मेरठ ', 'जिला अध्यक्ष ', '7906716330'],
    ['श्री रामजी अग्रहरि ', 'अमेठी ', 'जिला अध्यक्ष ', '9415381724'],
    ['श्री ध्रुव आचार्य ', 'फ़िरोज़ाबाद ', 'जिला अध्यक्ष ', '9837202223'],
    ['श्री राजेश जायसवाल', 'सिद्धार्थनगर ', 'जिला अध्यक्ष ', '9838863670'],
    ['श्री कुंदन बरनवाल ', 'भदोही ', 'जिला अध्यक्ष ', '9839704487'],
    ['श्री रामनगिना गुप्ता ', 'चंदौली ', 'जिला अध्यक्ष ', '9415374696'],
    ['श्री प्रदीप कुमार जायसवाल ', 'वाराणसी ', 'जिला अध्यक्ष ', '8182000001'],
    ['श्री प्रशांत सराईया ', 'ग़ाज़ियाबाद ', 'जिला अध्यक्ष ', '9953739889'],
    ['श्री ब्रज किशोर गुप्ता ', 'बस्ती ', 'जिला अध्यक्ष ', '7007031923'],
    ['श्री मनोज गुप्ता ', 'फतेहपुर', 'जिला अध्यक्ष ', '9984899999'],
    ['श्री सतीश अग्रवाल', 'अमरोहा', 'जिला अध्यक्ष ', '9759752050'],
    ['श्री प्रशांत जैन ', 'सोनभद्र ', 'जिला अध्यक्ष ', '9532355954'],
    ['श्री नितिन केसरवानी ', 'प्रतापगढ़', 'जिला अध्यक्ष ', '8081090000'],
    ['श्री प्रशांत कसौधन ', 'सुल्तानपुर ', 'जिला अध्यक्ष ', '9838506741'],
    ['श्री दिनेश जायसवाल ', 'बाराबंकी', 'जिला अध्यक्ष ', '९४५३३०४२१८'],
    ['', '', '', ''],
    ['श्री लोकेश अग्रवाल ', 'मथुरा ', 'महानगर अध्यक्ष ', '7351883000'],
    ['श्री संजय अग्रवाल (सी.ए. )', 'बरेली ', 'महानगर अध्यक्ष ', '9897031321 '],
    ['श्री गौरव माहेश्वरी ', 'लखनऊ ', 'महानगर अध्यक्ष ', '8127392575'],
    ['श्री रोहिताश  चंद्र राजू ', 'अयोध्या ', 'महानगर अध्यक्ष ', '8009629015'],
    ['श्री बृजेश गुप्ता ', 'सहारनपुर 	 ', 'महानगर अध्यक्ष ', '7060210590'],
    ['श्री सचिन सिंघल ', 'मुरादाबाद ', 'महानगर अध्यक्ष ', '9837051973'],
    [
      'श्री ब्रज भूषण गर्ग (अधिवक्ता)',
      'मेरठ ',
      'महानगर अध्यक्ष ',
      '9412202163'
    ],
    ['श्री अशोक गोयल ', 'ग़ाज़ियाबाद ', 'महानगर अध्यक्ष ', '9868124165'],
    [
      'श्री शुशील कुमार गुप्ता (पार्षद)',
      'वाराणसी ',
      'महानगर अध्यक्ष ',
      '9889666565'
    ],
    ['श्री अनूप अग्रहरि', 'गोरखपुर', 'महानगर अध्यक्ष ', '9415314637'],
    ['श्री विजय गुप्ता', 'प्रयागराज', 'महानगर अध्यक्ष ', '9415634049'],
    ['श्री राघवेंद्र कुमार ', 'आगरा', 'महानगर अध्यक्ष ', '8077737461'],
  ];

  static List sansadList = [
    ['श्री नरेंद्र दामोदर दास मोदी ', 'प्रधानमंत्री / सांसद ', 'वाराणसी'],
    ['श्री राजेंद्र अग्रवाल', 'सांसद ', 'मेरठ'],
    ['श्री संगम लाल गुप्ता ', 'सांसद ', 'प्रतापगढ़ '],
    ['श्री अनिल अग्रवाल ', 'सांसद ', 'गाजियाबाद'],
    ['श्री डॉ. राधा मोहन दस अग्रवाल ', 'सांसद ', 'गोरखपुर ']
  ];

  static List mlaList = [
    ['श्री पुरुषोत्तम खंडेलवाल ', 'आगरा नार्थ', 'एम.एल.ए', '9410667471'],
    ['श्रीमती मुक्ता वार्ष्णेय ', 'अलीगढ ', 'एम.एल.ए', '9058810035'],
    ['श्री नन्द गोपाल गुप्ता ', 'प्रयागराज साउथ ', 'एम.एल.ए', '9839609501'],
    ['श्री विकास गुप्ता ', 'अयाह शाह ', 'एम.एल.ए', '9918046999'],
    ['श्री वेद प्रकाश गुप्ता ', 'अयोध्या ', 'एम.एल.ए', '8887151075'],
    ['श्री महेश गुप्ता ', 'बदाऊं ', 'एम.एल.ए', '9415607320'],
    ['श्रीमती अनुपमा जायसवाल ', 'बहराइच ', 'एम.एल.ए', '9839906175'],
    ['श्री संजीव अग्रवाल ', 'बरैली कैंट ', 'एम.एल.ए', '9837002825'],
    ['श्री अतुल गर्ग ', 'ग़ाज़ियाबाद ', 'एम.एल.ए', '9811037560'],
    ['श्री जयकिशन साहू ', 'ग़ाज़ीपुर ', 'एम.एल.ए', '9415241047'],
    ['श्री नितिन अग्रवाल ', 'हरदोई  ', 'एम.एल.ए', '9839721000'],
    ['श्री मोहन वर्मा ', 'हात्ता ', 'एम.एल.ए', '9794077973'],
    ['श्री नीरज बोरा ', 'लखनऊ ', 'एम.एल.ए', '8887150972'],
    ['श्री अमित अग्रवाल  ', 'मेरठ कैंट ', 'एम.एल.ए', '9837044144'],
    ['श्री रितेश गुप्ता ', 'मोरादाबाद नगर ', 'एम.एल.ए', '9412244566'],
    ['श्री रमेश जायसवाल ', 'मुग़लसराय ', 'एम.एल.ए', ''],
    ['श्री कपिल देव अग्रवाल ', 'मुज़फ्फर नगर ', 'एम.एल.ए', '9837067089'],
    ['श्री मनीष जायसवाल ', 'पडरौना ', 'एम.एल.ए', '9415278106'],
    ['श्री सुरेंद्र चौरसिया ', 'रामपुर कारखाना ', 'एम.एल.ए', '9415964410'],
    ['श्री विनय वर्मा ', 'शोहरतगढ़ ', 'एम.एल.ए', '9818444806'],
    ['श्री राकेश राठौर ', 'सीतापुर ', 'एम.एल.ए', '9415565266'],
    ['श्री पंकज गुप्ता ', 'उन्नाव', 'एम.एल.ए', '8765954704'],
    ['श्री रविंद्र जायसवाल ', 'वाराणसी नार्थ ', 'एम.एल.ए', '9415202394'],
    ['डॉ. सरोजिनी अग्रवाल ', 'मेरठ', 'एम.एल.ए', '9415608085'],
    ['श्री अनूप कुमार गुप्ता ', 'लखीमपुर ', 'एम.एल.ए', '9415100007'],
    ['श्री विजय शिवहरे ', 'आगरा ', 'एम.एल.ए', '9412260075'],
    ['डॉ. सुधीर गुप्ता ', 'शाहजहांपुर ', 'एम.एल.ए', '9919811111'],
    ['श्री दिनेश गोयल  ', 'ग़ाज़ियाबाद ', 'एम.एल.ए', '9810320945'],
    ['श्री अशोक अग्रवाल ', 'हरदोई ', 'एम.एल.ए', '8795817010'],
    ['डॉ. आकाश अग्रवाल  ', 'आगरा ', 'एम.एल.ए', '8193849760'],
    ['श्री सलिल बिश्नोई ', 'कानपुर', 'एम.एल.ए', '9415041666'],
  ];

  static List mayorList = [
    ['श्री नवीन जैन ', 'आगरा ', 'महापौर ', '7300740687'],
    ['श्री रामत्रिनाथ सिंघल ', 'झाँसी ', 'महापौर ', '9415031128'],
    ['श्रीमती अभिलाषा गुप्ता ', 'प्रयागराज  ', 'महापौर ', '9119801111'],
    ['श्री सीताराम जायसवाल ', 'गोरखपुर  ', 'महापौर ', '7311180200'],
    ['श्री विनोद अग्रवाल ', 'मोरादाबाद  ', 'महापौर ', '9837043502'],
    ['श्रीमती मृदुला जायसवाल ', 'वाराणसी  ', 'महापौर ', '9415336400'],
    ['श्री संजीव वालिआ ', 'सहारनपुर  ', 'महापौर ', '9675600600'],
    ['श्रीमती नूतन राठौर ', 'फ़िरोज़ाबाद ', 'महापौर ', '9105081000'],
    ['श्रीमती अंजू चौधरी ', 'फ़िरोज़ाबाद ', 'महापौर ', '9105081000'],
    // ['श्रीमती नूतन राठौर ', 'फ़िरोज़ाबाद ', 'महापौर ', '9105081000'],
  ];

  static String girishInfo =
      """डा० गिरीश कुमार सांघी जी एक गतिशील नेता है, जो अपनी लीक से हटकर सोचने के लिए जाने जाते है।  
राजनैतिक , आर्थिक एवं सामाजिक विषयो पर लोग आपसे जरुरी सलाह लेते हैं । आप राजनीति विज्ञान में स्नातकोत्तर हैं और आपको उस्मानिया विश्वविद्यालय द्वारा पीएचडी की उपाधि से सम्मानित किया गया है। 1955 में जन्मे, आपने 24 साल की कम उम्र में अपना करियर शुरू किया। आपके पास आन्ध्र प्रदेश में कपड़ा उद्योग विकसित करने के लिए एक महान दृष्टिकोण था। उन्होंने 1979 में कपड़ा प्रसंस्करण के लिए एक कारखाना स्थापित किया जो आज भी प्रतिष्ठित संस्थानों में से एक है। अपनी व्यावहारिक सोच को आपने जन-जन तक पहुँचाने की आवश्यकता महसूस की, जिसके परिणामस्वरूप एक तेलुगु दैनिक 'वार्ता' और एक हिंदी दैनिक 'स्वतंत्र वार्ता' को जन्म दिया। आपने 2004 - 2010 तक राज्य सभा में आंध्र प्रदेश का प्रतिनिधित्व किया। आपको विभिन्न संसदीय स्थायी समितियों के सह -अध्यक्ष के तौर पर सूचना और प्रौद्योगिकी, उद्योग मंत्रालय, वित्त मंत्रालय और ग्रामीण विकास मंत्रालय के  सतर्कता और निगरानी समिति के पैनल में लाया गया। अखिल भारतीय वैश्य महासम्मेलन के राष्ट्रीय अध्यक्ष के तौर पर आपने विभिन प्रदेशो और जिलों का दौरा किया, जिसके परिणामस्वरूप विभिन्न वैश्य संघों का एकीकरण हुआ । बिहार और झारखण्ड  में आपने 2009  में वैश्य समाज के विभिन्न घटको को एकजुट करने के  वैश्य चेतना रथ यात्रा निकली थी जिसका दोनों राज्यों में राजनितिक रूप से काफी प्रभाव पड़ा| सम्पूर्ण वैश्य समाज आपको अपना अगुवा मान कर उन्नति और समृद्धि की ओर अग्रसर हैं ।""";

  static String gopalMorInfo =
      "गोपाल मोर जी का जन्म 11 जुलाई 1966 को हुआ| उनके पिता स्वर्गीय श्री मणिशंकर जी मोर देशभक्त एवम व्यापारियों की बिरादरी के संस्थापक सदस्य भी थे | श्री गोपाल मोर ने सेठ नरसिंगदास मोर कॉलेज ऑफ़ कॉमर्स, नागपुर विश्वविद्यालय से स्नातक किया | देश में किसी भी राष्ट्रीय आपदा के दौरान उन्होंने वैश्य समुदाय द्वारा उठाये गए राहत कार्यों में व्यक्तिगत रूप से भाग लिया | अखिल भारतीय वैश्य महासम्मेलन में पूर्व राष्ट्रीय अध्यक्ष श्री रामदास अग्रवाल जी पूर्व सांसद के साथ रहकर कई पदों पर कार्य किया, इसके अलावा वह राष्ट्रीय युवा अध्यक्ष, अखिल भारीतय वैश्य महासम्मेलन रहे | वर्तमान में वह अखिल भारतीय वैश्य महासम्मेलन के राष्ट्रीय महामंत्री के पद पर रहकर डॉ. गिरीश कुमार संघी, पूर्व सांसद और राष्ट्रीय अध्यक्ष, अखिल भारतीय वैश्य महासम्मेलन के साथ संगठन को सुदृढ़ एवम व्यापक विस्तार करने हेतु सम्पूर्ण भारत में विभिन्न कार्यक्रमों का आयोजन कर रहे हैं |";

  static String letter =
      "आदरणीय राष्ट्रीय अध्यक्ष डॉ. गिरीश सांघी जी ने 11 अप्रैल 2022 को अपने हैदराबाद स्थित आवास पर राष्ट्रीय महामंत्री श्री उमेश अग्रवाल जी की उपस्थिति में श्री सुधीर एस. हलवासिया  को  प्रदेश अध्यक्ष का मनोनयन पत्र भेंट किया|";
  static String umeshInfo =
      "श्री उमेश अग्रवाल, 1966 में हरियाणा के अस्तित्व में आने के बाद से अब तक हुए विधानसभा चुनाव में किसी भी उम्मीदवार से पूरे प्रदेश में सर्वाधिक, 84015 वोटों से 2014 चुनाव में विजयी होने वाले पहले विधायक थे | इस चुनाव में अन्य सभी उम्मीदवारों की जमानत जब्त हुई | वर्त्तमान में वह अखिल भारतीय वैश्य महासम्मेलन के राष्ट्रीय महामंत्री के पद पर कार्यरत रहते हुए 5 जून 2022 को दिल्ली स्थित तालकटोरा स्टेडियम में भव्य वैश्य प्रतिनिधि सम्मेलन में अग्रणी भूमिका निभाई | अखिल भारतीय वैश्य महासम्मेलन का महामंत्री पद सम्भ्भलने से पहले हरियाणा प्रदेश के अध्यक्ष रहे | आप संगठन में उत्तर भारत के प्रभारी है | दिल्ली के तालकटोरा स्टेडियम में ५ जून को आयोजित ऐतिहासिक विराट वैश्य प्रतिनिधि सम्मलेन के संयोजक थे |";

  static String arunaInfo =
      "अरुणा ओसवाल जी ने 1989 में जिला 323 ए3 के जुहू के लायंस क्लब के साथ अपनी यात्रा शुरू की। वर्ष 1999-2000 में वह अध्यक्ष बनीं और तेजी से सिंहवाद की सीढ़ियाँ चढ़ीं, और 2004-05 में, वे जिला 323 ए3 की जिला राज्यपाल बनीं। महिला सशक्तिकरण के लिए 1,000 सिलाई मशीनों के वितरण की एक परियोजना की बहुत सराहना की गई। वह प्रधान मंत्री माननीय श्री अटलबिहारी बाजपेयी द्वारा जैन रत्न पुरस्कार प्राप्तकर्ता हैं। उन्हें पूर्व राष्ट्रपति माननीय श्री अब्दुल कलाम के योग्य हाथों से भी सम्मानित किया जा चुका है। \nअरुणाजी का दृढ़ विश्वास है कि उनके गुरु, मित्र, दार्शनिक, मार्गदर्शक और प्रेरक शक्ति कोई और नहीं बल्कि उनके पति (श्री अभय कुमार ओसवाल जी) रहे हैं। अरुणाजी ने समाज सेवा की यात्रा में मानवता की सेवा करने के अपने सभी सपनों को पूरा करने का संकल्प लिया है।";

  static String snchandakInfo =
      'डॉ. सत्य नारायण चांडक दिल्ली के निवासी है |अखिल भारतीय वैश्य महासम्मेलन के राष्ट्रीय कोषाध्यक्ष है तथा २० सालो से संगठन से सक्रिय रूप से जुड़े हुए है | उनके नेतृत्व में देशभर में तमाम उद्यमी उद्योगपति नौजवान महिलाएं लगातार संस्था के सदस्य बन रहे है और संस्था के आर्थिक संरचना को मजबूत करने के लिए लगातार प्रयासरत है | उनका व्यवसाय किशनगढ़, राजस्थान में मार्बल का, जयपुर में कोचिंग का तथा गुडगाँव और बहराइच में हॉर्टिकल्चर और टिश्यू कल्चर का है | उनके वयवसाय के लिए विभिन्न राष्ट्रीय तथा अंतररष्ट्रीय पुरस्कारों से सम्मानित किया गया है |';
}
